Repository: python-docs-ko/PEPs-OmegaT
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ko

source: Block Comments --------------
ko: 블록 주석문 -----------

source: Block comments generally apply to some (or all) code that follows them, and are indented to the same level as that code. Each line of a block comment starts with a ``#`` and a single space (unless it is indented text inside the comment).
ko: 블록 주석문은 일반적으로 블록 주석문 이후에 기술되는 일부(혹은 전체) 코드와 관련된 내용이며, 해당 코드와 같은 수준만큼 들여쓰게 된다. 블록 주석문의 각 행은 ``#``\ 문자와 한 개의 공백으로 시작된다(코멘트 내부에 들여쓰기된 텍스트가 있을 경우는 제외)

source: But most importantly: know when to be inconsistent -- sometimes the style guide just doesn't apply. When in doubt, use your best judgment. Look at other examples and decide what looks best. And don't hesitate to ask!
ko: 하지만 무엇보다 중요한 것은, 어느 순간에 일관성을 버려야 할 지 알아야 한다는 것이다 - 어떤 순간에는 스타일 가이드를 적용하지 않을 수 있다. 의심이 든다면 최선을 다해 판단해라. 다른 예제들을 살펴보고 어떤 것이 가장 좋아 보이는지 결정하라. 그리고 주저하지 말고 질문하라!

source: But sometimes, this is useful::
ko: 하지만 이런 주석문은 유용할 때가 있다. ::

source: C dialect =========
ko: C 방언 ======

source: Circular references
ko: 순환 참조

source: Class Names ~~~~~~~~~~~
ko: 클래스 이름 ~~~~~~~~~~~

source: Class naming conventions apply here, although you should add the suffix "Error" to your exception classes, if the exception is an error. Non-error exceptions need no special suffix.
ko: 예외에는 클래스 이름 규칙이 적용되지만, 이 예외 클래스가 에러를 나타낼 경우에는 "Error"를 접미사로 붙여야 한다. 에러가 아닌 예외의 경우에는 특별한 접미사를 붙일 필요가 없다.

source: Code in the core Python distribution should always use the ASCII or Latin-1 encoding (a.k.a. ISO-8859-1). For Python 3.0 and beyond, UTF-8 is preferred over Latin-1, see PEP 3120.
ko: 파이썬 배포본 내의 코드는 항상 ASCII 혹은 Latin-1 인코딩(ISO-8859-1 이라고도 한다)을 사용해야 한다. 파이썬 3.0 이상 버전에서는 Latin-1 대신 UTF-8을 권장한다(PEP 3120을 참고하라).

source: Code lay-out ============
ko: 코드 레이아웃 =============

source: Codetags have been under discussion and in use (hundreds of codetags in the Python 2.4 sources) in many places (e.g., c2_) for many years. See References_ for further historic and current information.
ko: Codetags have been under discussion and in use (hundreds of codetags in the Python 2.4 sources) in many places (e.g., c2_) for many years. See 참조_ for further historic and current information.

source: Comments --------
ko: 주석 ----

source: Comments ========
ko: 주석문 ======

source: Comments should be complete sentences. If a comment is a phrase or sentence, its first word should be capitalized, unless it is an identifier that begins with a lower case letter (never alter the case of identifiers!).
ko: 주석은 완결된 문장 형태로 작성한다. 한 구절 혹은 문장으로 이루어진 주석을 작성할 경우, 첫 번째 단어를 대문자로 기술한다. 예외적으로, 이 첫 번째 단어가 소문자로 된 식별자일 경우에는 그대로 소문자로 기술한다 (이렇게 식별자를 주석에 사용할 경우에는 절대 소문자/대문자를 바꾸지 말아야 한다).

source: Comments that contradict the code are worse than no comments. Always make a priority of keeping the comments up-to-date when the code changes!
ko: 코드의 내용과 동떨어진 주석이 있는 것보다는 아예 주석이 없는 편이 낫다. 주석은 항상 코드의 변경에 맞추어 최신의 상태를 유지하도록 한다.

source: Compatibility of C API
ko: C API의 호환성

source: Concerns
ko: 우려

source: Constants ~~~~~~~~~
ko: 상수 ~~~~

source: Constants are usually defined on a module level and written in all capital letters with underscores separating words. Examples include ``MAX_OVERFLOW`` and ``TOTAL``.
ko: 상수는 보통 모듈 수준에서 정의되며, 대문자 및 단어를 구분하기 위한 언더스코어 문자로 구성된다. ``MAX_OVERFLOW``와 ``TOTAL`` 등의 예를 들 수 있다.

source: Continuation lines should align wrapped elements either vertically using Python's implicit line joining inside parentheses, brackets and braces, or using a hanging indent. When using a hanging indent the following considerations should be applied; there should be no arguments on the first line and further indentation should be used to clearly distinguish itself as a continuation line.
ko: 여러 줄에 걸쳐 코드를 작성할 경우 파이썬의 괄호, 중괄호('{'), 대괄호 ('[')처럼 암시적으로 여러 줄을 결합하는 기능을 사용하거나, 들여쓰기 (hanging indent)를 사용하여 코드의 요소들을 수직으로 정렬해야 한다. 들여쓰기를 사용하려면 다음과 같은 사항을 고려해야 한다. 첫 번째 줄에 인수가 오면 안 되며, 들여쓰기를 계속 사용할 경우 행이 계속된다는 사실 을 분명히 파악할 수 있도록 사용해야 한다.(역자 주: 문장 중간에 들여쓰기를 사용하는 형식을 hanging indent라고 함. 다음 URL을 참고하라. http://www.fanhow.com/images/9/91/How_to_Create_hanging_indent_using_CSS_2.png)

source: Conventions
ko: 관례

source: Conventions for writing good documentation strings (a.k.a. "docstrings") are immortalized in PEP 257.
ko: 좋은 문서화 문자열(Documentation String, docstring이라고도 한다)을 작성하기 위한 규칙으로 PEP 257가 널리 알려져 있다.

source: Copyright
ko: 저작권

source: Copyright This document has been placed in the public domain.
ko: 저작권 이 문서는 퍼블릭 도메인에 속한다.

source: Copyright ---------
ko: 저작권 ------

source: Copyright =========
ko: 저작권 ======

source: Current Solution
ko: 현재 해결책

source: Definitely not::
ko: 절대 안됨::

source: Descriptive: Naming Styles --------------------------
ko: 표현: 명명 스타일 -----------------

source: Design and Implementation
ko: 설계 및 구현

source: Designing for inheritance ~~~~~~~~~~~~~~~~~~~~~~~~~
ko: 상속을 위한 설계 ~~~~~~~~~~~~~~~~

source: Developers with hg push privileges for the `PEP repository`_ may claim PEP numbers directly by creating and committing a new PEP. When doing so, the developer must handle the tasks that would normally be taken care of by the PEP editors (see `PEP Editor Responsibilities & Workflow`_). This includes ensuring the initial version meets the expected standards for submitting a PEP. Alternately, even developers may choose to submit PEPs through the PEP editors. When doing so, let the PEP editors know you have hg push privileges and they can guide you through the process of updating the PEP repository directly.
ko: `PEP 저장소`_\ 에 대한 hg push 권한을 가진 개발자는 새로운 PEP를 생성 및 커밋함으로써 직접 PEP 번호를 얻을 수 있다. 그렇게 할 때에는, 개발자는 일반적으로 PEP 편집자가 담당하는 업무를 처리하여야 한다(`PEP 편집자의 책임 및 흐름`_ 참조). 초기 버전이 PEP를 제출하는 데에 있어 따라야 하는 표준을 충족하는지 확인하는 것을 포함한다. 다른 방법으로, 개발자가 PEP를 PEP 편집자에게 제출하는 것을 선택할 소수도 있다. 그럴 경우에는 당신이 hg push 권한을 갖고 있다는 것을 PEP 편집자에게 알림으로써 PEP 저장소에 직접 업데이트하는 절차에 대한 안내를 받기 바란다.

source: Developers(s)
ko: 개발자

source: Development and Discussion
ko: 개발 및 논의

source: Discussion
ko: 논의

source: Documentation Strings ---------------------
ko: 문서화 문자열 -------------

source: Documentation Strings =====================
ko: 문서화 문자열 =============

source: Each PEP must begin with an RFC 822 style header preamble. The headers must appear in the following order. Headers marked with "*" are optional and are described below. All other headers are required. ::
ko: 각 PEP의 첫머리에는 RFC 822 스타일의 헤더가 반드시 있어야 한다. 각 헤더는 다음의 순서를 따른다. "*" 표시가 된 헤더는 생략할 수 있으며, 아래에 설명한다. 그 외의 헤더는 필수이다. ::

source: Each PEP must have a champion -- someone who writes the PEP using the style and format described below, shepherds the discussions in the appropriate forums, and attempts to build community consensus around the idea. The PEP champion (a.k.a. Author) should first attempt to ascertain whether the idea is PEP-able. Posting to the comp.lang.python newsgroup (a.k.a. python-list@python.org mailing list) or the python-ideas mailing list is the best way to go about this.
ko: 각 PEP에는 다음에 기술된 문체와 형식에 따라 PEP를 작성하고, 적절한 포럼에서 토의하며, 아이디어에 대한 커뮤니티의 합의를 구축할 사람이 필요하며, 그러한 역할을 담당하는 사람을 챔피언이라 한다. 이러한 PEP 챔피언(혹은 저자)는 아이디어가 PEP가 될 수 있는지 일단 검토해야 한다. comp.lang.python 뉴스그룹 (혹은 python-list@python.org 메일링 리스트) 또는 python-ideas 메일링 리스트에 게재하는 것이 최선의 방법이다.

source: Each PEP should have the following parts:
ko: 각 PEP는 다음과 같은 부분을 갖추어야 한다.

source: Early core developer attempts to use function annotations revealed inconsistent, ad-hoc annotation styles. For example:
ko: 함수 어노테이션을 사용하던 초기의 핵심 개발자들은 일관성 없는 임기응변식 어노테이션 스타일이 존재한다는 것을 발견했다. 예를 들면:

source: Easter Egg
ko: 이스터 에그

source: Effects on Other Tools
ko: 다른 도구에 대한 영향

source: Encodings (PEP 263) -------------------
ko: 인코딩 (PEP 263) ----------------

source: Example
ko: 예

source: Example:
ko: 예:

source: Examples
ko: 예

source: Examples:
ko: 예:

source: Exception Names ~~~~~~~~~~~~~~~
ko: 예외 이름 ~~~~~~~~~

source: Extra blank lines may be used (sparingly) to separate groups of related functions. Blank lines may be omitted between a bunch of related one-liners (e.g. a set of dummy implementations).
ko: 서로 연관이 있는 함수들의 묶음을 구분하기 위해 빈 줄을 추가로 사용할 수 있다. 반대로 한 줄짜리 구현 코드가 뭉쳐 있을 경우 이러한 빈 줄을 생략할 수도 있다. (예: 일련의 미구현, 임시 코드)

source: Features
ko: 기능

source: Files using ASCII should not have a coding cookie. Latin-1 (or UTF-8) should only be used when a comment or docstring needs to mention an author name that requires Latin-1; otherwise, using ``\x``, ``\u`` or ``\U`` escapes is the preferred way to include non-ASCII data in string literals.
ko: ASCII 인코딩을 사용하는 파일은 코딩 쿠키를 포함하면 안 된다. 주석 혹은 docstring에서 Latin-1 문자로 기록된 문서 작성자의 이름을 언급할 필요가 있을 때에만 Latin-1(혹은 UTF-8)을 사용한다. 혹은, 비 ASCII 데이터를 문자 상수에 넣으려면 ``\x``, ``\u``, ``\U`` 등의 이스케이프 문자를 사용하길 권한다.

source: Following a discussion on python-ideas, the proposal should be sent as a draft PEP to the PEP editors <peps@python.org>. The draft must be written in PEP style as described below, else it will be sent back without further regard until proper formatting rules are followed (although minor errors will be corrected by the editors).
ko: python-ideas에서의 논의에 따라, 그 제안은 PEP 초안으로서 PEP 편집자 <peps@python.org> 메일링 리스트에 전달되어야 한다. 초안은 아래에 기술하는 PEP 형식에 맞추어 기술하여야 하며, 그렇지 않으면 올바른 형식을 따를 때까지 검토 없이 반송된다(작은 오류는 편집자가 수정한다).

source: Footnotes ---------
ko: 각주 ----

source: For C code that needs to support versions of Python older than 2.3, you can include this after including ``Python.h``::
ko: 파이썬 2.3 버전 이전을 지원해야하는 C 코드에서는, ``Python.h``\ 를 포함한 후에 다음을 포함한다. ::

source: For Python 3.0 and beyond, the following policy is prescribed for the standard library (see PEP 3131): All identifiers in the Python standard library MUST use ASCII-only identifiers, and SHOULD use English words wherever feasible (in many cases, abbreviations and technical terms are used which aren't English). In addition, string literals and comments must also be in ASCII. The only exceptions are (a) test cases testing the non-ASCII features, and (b) names of authors. Authors whose names are not based on the latin alphabet MUST provide a latin transliteration of their names.
ko: 파이썬 3.0 이상 버전에서는 표준 라이브러리에 대해 다음과 같은 정책을 취하고 있다(PEP 3131을 참고): 파이썬 표준 라이브러리에서는 ASCII 문자만으로 구성된 식별자를 사용해야 하며, 모든 경우에 적절한 영어 단어를 사용하는 것이 좋다(많은 경우, 어어라고 할 수 없는 약어와 기술 용어가 쓰이곤 한다). 또한, 문자 상수와 주석 또한 ASCII로 작성되어야 한다. 유일한 예외는 (a) 비 ASCII 문자가 포함된 기능을 테스트하는 테스트 케이스 (b) 작성자의 이름. 라틴 알파벳 이외의 문자를 사용하는 이름을 가진 작성자는 자신의 이름에 대한 라틴어 음역을 같이 제공해야 한다.

source: For a PEP to be accepted it must meet certain minimum criteria. It must be a clear and complete description of the proposed enhancement. The enhancement must represent a net improvement. The proposed implementation, if applicable, must be solid and must not complicate the interpreter unduly. Finally, a proposed enhancement must be "pythonic" in order to be accepted by the BDFL. (However, "pythonic" is an imprecise term; it may be defined as whatever is acceptable to the BDFL. This logic is intentionally circular.) See PEP 2 [2]_ for standard library module acceptance criteria.
ko: PEP가 수용되기 위해서는 몇 가지 최소한의 요건을 갖추어야 한다. 그것은 제안하는 개선사항에 대한 명확하고 완전한 기술이어야 한다. 개선은 완전한 구현을 표현해야 한다. 제안하는 구현은 가능하다면 변함이 없고 인터프리터를 지나치게 복잡하게 만들지 않아야 한다. 마지막으로, 제안하는 개선 사항이 BDFL에 의해 수용되기 위해서는 반드시 "파이썬다와야(pythonic)" 한다. (그러나, "파이썬다움"은 부정확한 단어이며, BDFL이 수용하느냐에 달려있다. 이것은 순환 논리이다.) 표준 라이브러리 모듈의 수용 요건에 대해서는 PEP 2\ [2]_\ 를 참조하라.

source: For a PEP where final pronouncement will be made on a list other than python-dev, a Discussions-To header will indicate the mailing list or URL where the pronouncement will occur. A temporary Discussions-To header may also be used when a draft PEP is being discussed prior to submission for pronouncement. No Discussions-To header is necessary if the PEP is being discussed privately with the author, or on the python-list, python-ideas or python-dev mailing lists. Note that email addresses in the Discussions-To header will not be obscured.
ko: 최종적인 공표가 python-dev 이외의 리스트에서 이루어진 PEP에 대해서는, Discussions-To 헤더에 공표가 이루어진 메일링 리스트 또는 URL을 지시하도록 한다. 공표를 제출하기 전에 논의 중에 있는 PEP 초안은 Discussions-To 헤더를 임시로 사용할 수 있다. 저자가 개인적으로 또는 python-list, python-ideas, python-dev 등에서 논의한 PEP에 대해서는 Discussions-To 헤더가 필수적이다. Discussions-To 헤더의 이메일 주소는 스팸 방지 처리를 하지 않는다.

source: For each new PEP that comes in an editor does the following:
ko: 편집자 리스트에 새로 들어온 PEP는 다음과 같은 일을 한다.

source: For example, do not rely on CPython's efficient implementation of in-place string concatenation for statements in the form ``a += b`` or ``a = a + b``. Those statements run more slowly in Jython. In performance sensitive parts of the library, the ``''.join()`` form should be used instead. This will ensure that concatenation occurs in linear time across various implementations.
ko: 예를 들면, CPython의 간단한 문자열 결합(``a += b``, ``a = a + b`` 같은 형태의)은 효율적으로 구현되어 있다. 하지만 Jython에서는 위 구문이 더 느리게 실행될 수 있으므로, CPython의 구현에 지나치게 의존해선 안 된다. 성능에 민감한 부분에서 문자열 결합 기능을 사용해야 할 경우 ``''.join()`` 메서드를 대신 사용해야 한다. 이 메서드는 다양한 파이썬 구현체에서 문자열 결합이 선형적 실행 시간을 갖도록 보장해 준다.

source: For example, use::
ko: 예를 들면, 다음과 같은 구문을 사용한다. ::

source: For new projects, spaces-only are strongly recommended over tabs. Most editors have features that make this easy to do.
ko: 새로운 프로젝트를 만들 경우 탭 문자 대신 공백 문자만을 사용하도록 하자. 대부분의 편집기에서는 이러한 작업을 쉽게 처리할 수 있다.

source: For really old code that you don't want to mess up, you can continue to use 8-space tabs.
ko: 정말 오래된 코드를 엉망으로 만들고 싶지 않은 경우라면, 8개의 공백을 계속 사용해도 된다.

source: Function Names ~~~~~~~~~~~~~~
ko: 함수 이름 ~~~~~~~~~

source: Function and method arguments ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ko: 함수와 메서드 인수 ~~~~~~~~~~~~~~~~~~

source: Function names should be lowercase, with words separated by underscores as necessary to improve readability.
ko: 함수 이름은 소문자를 사용하며, 가독성을 높이기 위해 각 단어는 언더스코어로 구분하도록 한다.

source: General -------
ko: 일반 ----

source: Global Variable Names ~~~~~~~~~~~~~~~~~~~~~
ko: 전역 변수 이름 ~~~~~~~~~~~~~~

source: Guidelines for submitting patches and making changes
ko: 패치와 변경사항의 제출에 대한 안내

source: Habits to Avoid ===============
ko: 피해야 할 습관 ==============

source: Here is a hyperlink reference to the `Abstract`_ section. The backquotes are optional since the reference text is a single word; we can also just write: Abstract_.
ko: Here is a hyperlink reference to the `Abstract`_ section. The backquotes are optional since the reference text is a single word; we can also just write: 초록_.

source: Historical Note
ko: 참고 이력

source: History
ko: 이력

source: History and Rationale
ko: 이력 및 근거

source: History of this Proposal
ko: 이 제안의 이력

source: How to Use This Template ========================
ko: 이 템플릿의 사용법 ==================

source: How you report a bug, or submit a PEP update depends on several factors, such as the maturity of the PEP, the preferences of the PEP author, and the nature of your comments. For the early draft stages of the PEP, it's probably best to send your comments and changes directly to the PEP author. For more mature, or finished PEPs you may want to submit corrections to the Python `issue tracker`_ so that your changes don't get lost. If the PEP author is a Python developer, assign the bug/patch to them, otherwise assign it to a PEP editor.
ko: PEP에 대한 버그를 보고하거나 수정사항을 제출하는 방법은 몇 가지 요건에 따라 달라지는데, PEP의 성숙도, PEP 저자의 취향, 그리고 여러분의 의견의 성격 등이다. PEP 작성 초반에는 여러분의 의견과 수정 사항을 PEP 저자에게 직접 전달하는 것이 최선일 것이다. PEP가 어느 정도 다듬어졌거나 완료된 경우에는 수정 사항을 Python `이슈 트래커`_\ 에 제출함으로써 수정 사항을 잃어버리지 않도록 하는 것이 좋다. PEP 저자가 Python 개발자인 경우, 버그/패치를 그들에게 할당하며, 그렇지 않은 경우에는 PEP 편집자에게 할당한다.

source: Hyperlinks ----------
ko: 하이퍼링크 ----------

source: If a comment is short, the period at the end can be omitted. Block comments generally consist of one or more paragraphs built out of complete sentences, and each sentence should end in a period.
ko: 주석문이 짧을 경우 마지막에 오는 마침표는 생략할 수 있다. 블록 형태의 주석문은 일반적으로 완결된 문장들로 구성된 문단들이며, 각각의 문단은 마침표로 끝나야 한다.

source: If a function argument's name clashes with a reserved keyword, it is generally better to append a single trailing underscore rather than use an abbreviation or spelling corruption. Thus ``class_`` is better than ``clss``. (Perhaps better is to avoid such clashes by using a synonym.)
ko: 함수 인수의 이름이 예약어와 충돌할 경우, 일반적으로 인수 이름의 끝에 언더스코어 문자 하나를 추가해 주는 것이 약어를 사용하거나 맞춤법을 어기는 이름을 사용하는 것 보다 낫다. 그러므로 ``class_``\ 를 사용하는 것이 ``clss``\ 를 사용하는 것보다 낫다. (아마 더 나은 방법은 동의어를 사용해서 이름 충돌을 피하는 방법일 것이다.)

source: If the PEP editors approve, they will assign the PEP a number, label it as Standards Track, Informational, or Process, give it status "Draft", and create and check-in the initial draft of the PEP. The PEP editors will not unreasonably deny a PEP. Reasons for denying PEP status include duplication of effort, being technically unsound, not providing proper motivation or addressing backwards compatibility, or not in keeping with the Python philosophy. The BDFL can be consulted during the approval phase, and is the final arbiter of the draft's PEP-ability.
ko: PEP 편집자가 승인하면, PEP에 번호를 붙이고, 표준 트랙, 정보 혹은 프로세스의 라벨을 붙이고, "초안" 상태를 부여하여 PEP의 최초 초안을 체크인한다. PEP 편집자는 이유 없이 PEP를 기각하지 않을 것이다. PEP 상태를 기각하는 주된 이유는 노력의 중복을 초래하거나, 기술적으로 나쁘거나, 적절한 동기 또는 하위 호환성을 제공하지 못하거나, 파이썬 철학에 위배되는 것 등이다. BDFL은 승인 단계에 관여할 수 있으며, 초안이 PEP가 될 수 있는지에 대한 최종 결정권을 갖는다.

source: If the PEP isn't ready, an editor will send it back to the author for revision, with specific instructions.
ko: PEP의 준비가 미흡하다면, 편집자는 구체적인 지침과 함께 저자에게 되돌려보내어 개정을 하도록 한다.

source: If the final decision on a PEP is to be made by a delegate rather than directly by the BDFL, this will be recorded by including the "BDFL-Delegate" header in the PEP.
ko: 최종 결정이 BDFL에 의하여 직접 이루어지지 않고 위임에 의한 것인 경우에는, PEP에 "BDFL-Delegate" 머리말로서 기록을 남긴다.

source: If the return value for the function is always None (because there is no meaningful return value), do not include the indication of the return type.
ko: 함수의 반환 값이 항상 None이라면(의미 있는 반환 값이 없기 때문), 반환 값에 대한 지시를 포함하지 않는다.

source: If there are multiple authors, each should be on a separate line following RFC 2822 continuation line conventions. Note that personal email addresses in PEPs will be obscured as a defense against spam harvesters.
ko: 복수의 저자가 있는 경우, RFC 2822의 이어지는 행 관례에 따라 행을 나눈다. PEP의 개인 이메일 주소는 무단으로 수집되는 것을 방지하기 위하여 읽기 어렵게 처리한다.

source: If this spelling causes local name clashes, then spell them ::
ko: 만약 이름이 이미 선언된 로컬 이름과 충돌할 경우, 다음과 같이 기술한다. ::

source: If you are interested in assuming ownership of a PEP, send a message asking to take over, addressed to both the original author and the PEP editors <peps@python.org>. If the original author doesn't respond to email in a timely manner, the PEP editors will make a unilateral decision (it's not like such decisions can't be reversed :).
ko: PEP의 소유권을 맡는 것에 관심이 있다면, 원저자와 PEP 편집자들 <peps@python.org> 양쪽에 메시지를 보내어 접수 의사를 밝히도록 하라. 원저자가 제때 답장하지 않는다면, PEP 편집자들이 단독으로 결정을 내리게 된다(번복이 불가능한 것은 아니다).

source: If you have to have Subversion, CVS, or RCS crud in your source file, do it as follows. ::
ko: 소스 파일에 Subversion, CVS, RCS 등이 포함되어 있다면 다음과 같이 버전을 기록한다. ::

source: Images ------
ko: 이미지 ------

source: Implementation
ko: 구현

source: Implementation Details
ko: 상세 구현

source: Implementation Proposal
ko: 구현 제안

source: Implementation Strategy
ko: 구현 전략

source: Implementations
ko: 구현

source: Imports -------
ko: 임포트 ------

source: Imports should be grouped in the following order:
ko: 임포트 구문은 다음 순서에 따라 그룹별로 기술한다.

source: In addition, the following special forms using leading or trailing underscores are recognized (these can generally be combined with any case convention):
ko: 또한, 다음과 같이 처음이나 끝에 언더스코어를 사용하는 특별한 형식이 있다 (이들은 보통 대소문자 관련 규칙과 함께 쓰일 수 있다).

source: In general, Standards track PEPs are no longer modified after they have reached the Final state. Once a PEP has been completed, the Language and Standard Library References become the formal documentation of the expected behavior.
ko: 일반적으로, 표준 트랙 PEP는 최종 상태에 도달한 이후에는 더 이상 수정되지 않는다. PEP가 일단 완료되면, 언어 및 표준 라이브러리 레퍼런스가 기대되는 작용에 대한 형식적 문서가 된다.

source: In some fonts, these characters are indistinguishable from the numerals one and zero. When tempted to use 'l', use 'L' instead.
ko: 특정 폰트에서는 이들 글자를 숫자 일, 영과 구별할 수 없다. 'l'을 굳 이 사용해야 할 경우에는 차라리 'L'을 사용하도록 하자.

source: Indentation -----------
ko: 들여쓰기 --------

source: Informational and Process PEPs may be updated over time to reflect changes to development practices and other details. The precise process followed in these cases will depend on the nature and purpose of the PEP being updated.
ko: 정보 및 프로세스 PEP는 개발 사례 및 기타 세부 사항에 대한 변경 사항을 반영하기 위해 시간이 지남에 따라 갱신될 수 있다. 정확한 과정은 갱신되는 PEP의 성격과 목적에 따라 달라진다.

source: Inline Comments ---------------
ko: 인라인 주석문 -------------

source: Inline comments are unnecessary and in fact distracting if they state the obvious. Don't do this::
ko: 뻔한 내용의 인라인 주석문은 불필요하며, 사실 방해물이라 할 수 있다. 이런 주석문은 피하자. ::

source: Interface
ko: 인터페이스

source: Introduction
ko: 도입

source: Introduction ============
ko: 도입 ====

source: It occasionally becomes necessary to transfer ownership of PEPs to a new champion. In general, it is preferable to retain the original author as a co-author of the transferred PEP, but that's really up to the original author. A good reason to transfer ownership is because the original author no longer has the time or interest in updating it or following through with the PEP process, or has fallen off the face of the 'net (i.e. is unreachable or not responding to email). A bad reason to transfer ownership is because the author doesn't agree with the direction of the PEP. One aim of the PEP process is to try to build consensus around a PEP, but if that's not possible, an author can always submit a competing PEP.
ko: 때로는 PEP에 대한 소유권을 새로운 챔피언에게 이양할 필요가 있다. 일반적으로, 원래의 저자가 공저자로서 계속 남도록 하지만, 이는 원저자가 판단할 문제이다. 소유권을 이양하는 좋은 이유로는, 원저자가 PEP를 절차에 따라 관리할 시간이나 흥미가 없다거나 인터넷에서 사라진 경우 (연락 두절 및 이메일에 답장을 하지 않음) 등이 있다. 좋지 못한 이유로는 저자가 PEP의 방향에 동의하지 않는 것이다. PEP 절차의 유일한 목표는 PEP에 대한 합의를 이루어내는 것이지만, 그것이 불가능하다면, 저자는 언제든지 경쟁적인 PEP를 제출할 수 있다.

source: It's okay to say this though::
ko: 하지만 이렇게 사용하는 것은 괜찮다. ::

source: Java Documentation
ko: Java 문서

source: Limit all lines to a maximum of 79 characters.
ko: 한 행에는 최대 79글자까지만 넣도록 한다.

source: Long time Pythoneer Tim Peters succinctly channels the BDFL's guiding principles for Python's design into 20 aphorisms, only 19 of which have been written down.
ko: 오랜 파이썬 선구자인 Tim Peters는 파이썬 설계에 대한 친절한 종신독재자의 가르침을 20개의 경구로 옮겼다. 여기에는 그 중 19개만을 적었다.

source: Major Changes to Existing Modules
ko: 기존 모듈에 대한 주요 변경사항

source: Many PEPs are written and maintained by developers with write access to the Python codebase. The PEP editors monitor the python-checkins list for PEP changes, and correct any structure, grammar, spelling, or markup mistakes they see.
ko: 많은 PEP가 Python 코드 기반에 대한 쓰기 권한을 가진 개발자에 의해 쓰여지고 관리된다. PEP 편집자는 python-checkins 목록에서 PEP의 변경 및 구조, 문법, 맞춤법, 마크업 실수 등에 대한 수정을 모니터한다.

source: Many programmers who are familiar with TeX often write quotation marks like this::
ko: Tex에 익숙한 많은 프로그래머들은 종종 따옴표를 다음과 같이 쓴다. ::

source: Maximum Line Length -------------------
ko: 한 행의 최대 길이 -----------------

source: Method Names and Instance Variables ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ko: 메서드 이름과 인스턴스 변수 ~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Method definitions inside a class are separated by a single blank line.
ko: 클래스의 메서드 정의는 한 줄을 띄워서 구분한다.

source: Minor Changes to Existing Modules
ko: 기존 모듈에 대한 작은 변경사항

source: Miscellaneous issues:
ko: 기타 이슈:

source: Modules or packages should define their own domain-specific base exception class, which should be subclassed from the built-in Exception class. Always include a class docstring. E.g.::
ko: 모듈, 패키지는 자신만의 특정 도메인을 기반으로 하는 예외 클래스를 정의해야 한다. 이들 예외 클래스는 파이썬에 내장된 Exception 클래스를 상속한다. 클래스 docstring을 항상 포함시켜야 한다. 예::

source: Modules should have short, all-lowercase names. Underscores can be used in the module name if it improves readability. Python packages should also have short, all-lowercase names, although the use of underscores is discouraged.
ko: 모듈은 소문자로 이루어진 짧은 이름을 사용해야 한다. 모듈 이름의 가독성을 높이기 위해 언더스코어를 사용할 수 있다. 파이썬 패키지 또한 소문자로 이루어진 짧은 이름을 사용해야 한다. 하지만 패키지의 경우에는 언더스코어를 가급적 사용하지 않는다.
